Repository: georgesk/thonny
Catalog: thonny/locale/*/LC_MESSAGES/thonny.po
Languages: fr_fr

source: <no message>
fr_fr: <pas de messages>

source: The code in `%s <%s>`__ looks good.
fr_fr: Le code à `%s <%s>`__ semble correct.

source: If it is not working as it should,
fr_fr: Si ça ne marche pas comme prévu,

source: then consider using some general
fr_fr: alors pensez à utiliser une technique

source: `debugging techniques <debugging.rst>`__.
fr_fr: `de débogage générique <debugging.rst>`__.

source: General advice on dealing with errors.
fr_fr: Les avis généraux au sujet des erreurs.

source: May be ignored if you are happy with your program.
fr_fr: Peuvent être ignorés si vous êtes content de votre programme.

source: May help you find the cause of the error.
fr_fr: Peuvent vous aider à trouver la cause d'une erreur.

source: Warnings
fr_fr: Avertissements

source: `Line %d <%s>`__ : %s
fr_fr: `Ligne %d <%s>`__ : %s

source: `More info online <%s>`__
fr_fr: `Plus d'information en ligne <%s>`__

source: Was it helpful or confusing?
fr_fr: Est-ce que ça a aidé, ou non ?

source: No specific suggestions for this error (yet).
fr_fr: Pas de suggestion spécifique pour cette erreur (actuellement).

source: Let Thonny developers know
fr_fr: Faites savoir aux développeurs de Thonny

source: Click on the feedback link at the bottom of this panel to let Thonny developers know
fr_fr: Cliquez sur la ligne des retours en bas de cet onglet pour faire savoir aux développeurs de Thonny

source: about your problem. They may add support for
fr_fr: votre problème. Ils peuvent ajouter un support pour

source: such cases in future Thonny versions.
fr_fr: de tels cas dans des versions futures de Thonny.

source: Search the web
fr_fr: Recherche sur le web

source: Try performing a web search for ``Python %s: %s``
fr_fr: Essayez une rcherche sur Internet pour ``Python %s: %s``

source: This error happened in library code. This may mean a bug in
fr_fr: Cette erreur s'est produite dans le code de la bibliothèque. Ça peut être une bogue dans

source: Send feedback for Assistant
fr_fr: Envoyer un retour pour l'Assistant

source: Below are the messages Assistant gave you in response to
fr_fr: Ci-dessous ce sont les messages de l'Assistant en réponse à

source: using the shell
fr_fr: l'usage du shell

source: testing '
fr_fr: le test de '

source: since
fr_fr: depuis

source: In order to improve this feature, Thonny developers would love to know how
fr_fr: Afin d'améliorer ce comportement, les développeurs de Thonny aimeraient connaître comment

source: useful or confusing these messages were. We will only collect version
fr_fr: ces messages ont été utilies ou non. Nous ne collecterons que les informations

source: information and the data you enter or approve on this form.
fr_fr: de version et les données que vous entrez ou approuvez sur ce formulaire.

source: Which messages were helpful (H) or confusing (C)? Click on [ ] to mark!
fr_fr: Quels messages ont été utiles (H=Helpful) ou non (C=Confusing) ? Cliquez sur [ ] pour le marquer !

source: Group / Message
fr_fr: Groupe / Message

source: Include Thonny's installation time (allows us to group your submissions)
fr_fr: Incluez la date d'installation de Thonny (ça nous aide à regrouper les retours)

source: Include snapshots of the code and Assistant responses at each run
fr_fr: Incluez des morceaux de code et les réponses de l'Assistant à chaque essai

source: Any comments? Enhancement ideas?
fr_fr: Des commentaires ? Des idées d'améliorations ?

source: (Preview the data to be sent)
fr_fr: (Relire les données avant envoi)

source: Submit
fr_fr: Envoyer

source: Cancel
fr_fr: Échap.

source: Uploading
fr_fr: Téléversement

source: Done!
fr_fr: Terminé !

source: Thank you for the feedback! Let us know again when Assistant helps or confuses you!
fr_fr: Merci pour votre retour ! Faites-nous savoir encore quand l'Assistant vous aide, ou pas !

source: Problem
fr_fr: Problème

source: Something went wrong: %s If you don't mind, then try again later!
fr_fr: Quelque chose a mal fonctionné : %s Si vous voulez bien, recommencez plus tard !

source: Python files
fr_fr: Fichiers Python

source: text files
fr_fr: fichiers texte

source: all files
fr_fr: tous fichiers

source: <untitled>
fr_fr: <sans titre>

source: File is gone
fr_fr: Le fichier a disparu

source: Looks like '%s' was deleted or moved outside Thonny.
fr_fr: On dirait que '%s' a été effacé ou déplacé indépendamment de Thonny.

source: Do you want to also close this editor?
fr_fr: Voulez-vous aussi fermer ce éditeur ?

source: External modification
fr_fr: Modification externe

source: Looks like '%s' was modified outside Thonny.
fr_fr: On dirait que '%s' a été modifié indépendamment de Thonny.

source: Do you want to discard current editor content and reload the file from disk?
fr_fr: Voulez-vous jeter le contenu courant de l'éditeur et le recharger depuis le disque ?

source: Finding cursor location
fr_fr: Recherche de l'emplacement du curseur

source: Permission Error
fr_fr: Erreur de permission

source: Looks like this file or folder is not writable.
fr_fr: On dirait que ce fichier ou ce répertoire n'est pas accessible en écriture.

source: Do you want to save under another folder and/or filename?
fr_fr: Voulez-vous faire la sauvegarde sous un autre répertoire/nom de fichier ?

source: Potential problem
fr_fr: Problème potentiel

source: If you name your script '%s',
fr_fr: Si vous nommez votre script '%s',

source: you won't be able to import the library module named '%s'
fr_fr: vous ne pourrez pas importer le module de bibliothèque appelé '%s'

source: Do you still want to use this name for your script?
fr_fr: Voulez-vous toujours utiliser ce nom pour votre script ?

source: New
fr_fr: Nouveau

source: Open...
fr_fr: Ouvrir ...

source: Load
fr_fr: Charger

source: Recent files
fr_fr: Fichiers récents

source: Close
fr_fr: Fermer

source: Close all
fr_fr: Tout fermer

source: Save
fr_fr: Enregistrer

source: Save as...
fr_fr: Enregistrer sous ...

source: Rename...
fr_fr: Renommer ...

source: Do you want to save files before closing?
fr_fr: Voulez-vous enregistrer les fichiers avant de fermer ?

source: Do you want to save file before closing?
fr_fr: Voulez-vous enregistrer le fichier avant de fermer ?

source: Save On Close
fr_fr: Enregistrer quand on ferme

source: Thonny options
fr_fr: Options de Thonny

source: Error when applying options in
fr_fr: Erreur à l'application des options dans

source: Error when cancelling options in
fr_fr: Erreur à l'annulation des options dans

source: Run current script
fr_fr: Lancer le script courant

source: Run
fr_fr: Lancer

source: Run current script in terminal
fr_fr: Lancer le script courant dans un terminal

source: Stop/Restart backend
fr_fr: Arrêter/Relancer la tâche d'arrière-plan

source: Interrupt execution
fr_fr: Interrompre l'exécution

source: other messages don't affect the state
fr_fr: les autres messages n'affectent pas l'état

source: Backend terminated (returncode: %s)
fr_fr: Tâche d'arrière-plan terminée (code de retour : %s)

source: Use 'Stop/Restart' to restart the backend ...
fr_fr: Utiliser Arrêter/Relancer pour redémarrer la tâche d'arrière-plan ...

source: Can't find backend '{}'. Please select another backend from options
fr_fr: Impossible de trouver la tâche d'arrière-plan '{}'. Veuillez en sélectionner une autre dans les options

source: print('Hi!'); input()
fr_fr: print('Bonjour !'); input()

source: Interpreter (%s) not found. Please recheck corresponding option!
fr_fr: Interpreteur (%s) non trouvé. Veuillez vérifier à nouveau l'option correspondante !

source: Starting the backend: %s %s
fr_fr: Démarrage de la tâche de fond : %s %s

source: Error starting backend process:
fr_fr: Erreur à l'initialisation de la tâche d'arrière-plan :

source: Please wait! Thonny prepares its virtual environment.
fr_fr: Veuillez patienter ! Thonny prépare son environnement virtuel.

source: Thonny's virtual environment was created for another interpreter.
fr_fr: L'environnement virtuel de Thonny a été créé pour une autre interpréteur.

source: Regenerating the virtual environment for current interpreter.
fr_fr: Regénération de l'environnement viruel pour l'interpréteur courant.

source: (You may need to reinstall your 3rd party packages)
fr_fr: (Vous devrez peut-être réinstaller vos paquet de tierces parties)

source: Please wait!.
fr_fr: Veuillez patienter !.

source: Preparing the backend
fr_fr: Préparation de la tâche d'arrière plan

source: Clear shell
fr_fr: Effacer le Shell

source: Plotter
fr_fr: Grapheur

source: Clear
fr_fr: Effacer

source: Close others
fr_fr: Fermer les autres

source: cannot use pack with this widget
fr_fr: impossible d'utiliser pack avec ce widget

source: cannot use place with this widget
fr_fr: impossible d'utiliser place avec ce widget

source: Unsupported focus
fr_fr: Focus non supporté

source: Remove linenumbers
fr_fr: Retirer les numéros de lignes

source: Do you want to remove linenumbers from pasted text?
fr_fr: Voulez-vous retirer les numéros de ligne du texte copié ?

source: Please wait!
fr_fr: Veuillez patienter !

source: Working
fr_fr: Travail en cours

source: Copying
fr_fr: Copie

source: Copying %s to %s
fr_fr: Copie de %s vers %s

source: Choose one
fr_fr: Choisir un

source: Choose one:
fr_fr: Choisir un :

source: Copy to clipboard
fr_fr: Copier dans le presse-papier

source: Done.
fr_fr: Terminé.

source: Return code:
fr_fr: Code de retour :

source: Cancel the process?
fr_fr: Arrêter le processus ?

source: The process is still running. Are you sure you want to cancel?
fr_fr: Le processus fontionne toujours. Êtes-vous sûr de vouloir l'arrêter ?

source: PROCESS CANCELLED
fr_fr: PROCESSUS ARRÊTÉ

source: Open file
fr_fr: Ouvrir le fichier

source: Open files
fr_fr: Ouvrir les fichiers

source: Save as
fr_fr: Enregistrer sous

source: Select directory
fr_fr: Sélectionner le répertoire

source: Cut
fr_fr: Couper

source: Copy
fr_fr: Copier

source: Paste
fr_fr: Coller

source: Select All
fr_fr: Tout sélectionner

source: File
fr_fr: Fichier

source: Edit
fr_fr: Édition

source: View
fr_fr: Afficher

source: Device
fr_fr: Périphérique

source: Tools
fr_fr: Outils

source: Help
fr_fr: Aide

source: The same interpreter which runs Thonny (default)
fr_fr: Le même interpréteur que pour Thonny (par défaut)

source: Alternative Python 3 interpreter or virtual environment
fr_fr: Un interpréteur Python3 alternatif ou un environnement virtuel

source: A special virtual environment (deprecated)
fr_fr: Un environnement virtuel spécial (obsolescent)

source: This virtual environment is automatically maintained by Thonny.
fr_fr: Cet environnement virtuel est automatiquement maintenu par Thonny.

source: Location:
fr_fr: Emplacement :

source: Exit
fr_fr: Terminer

source: Increase font size
fr_fr: Augmenter la taille de police

source: Decrease font size
fr_fr: Diminuer la taille de police

source: Focus editor
fr_fr: Passer dans l'éditeur

source: Focus shell
fr_fr: Passer dans le Shell

source: Maximize view
fr_fr: Maximiser la fenêtre

source: Full screen
fr_fr: Plein écran

source: Change font size
fr_fr: Modifier la taille de police

source: Exit Thonny
fr_fr: Sortir de Thonny

source: Overwriting theme '%s'
fr_fr: Écraser le thème '%s'

source: Only numeric dimensions supported at the moment
fr_fr: Seles les dimensions numériques sont supportées actuellement

source: Can't find theme '%s'
fr_fr: Impossible de trouver le thème '%s'

source: Program arguments:
fr_fr: Arguments du programme :

source: Program arguments
fr_fr: Arguments du programme

source: Switch to regular mode
fr_fr: Basculer dans le mode régulier

source: Regular mode
fr_fr: Mode régulier

source: Configuration has been updated.
fr_fr: La configuration a été mise à jour.

source: Restart Thonny to start working in regular mode.
fr_fr: Redémarrer Thonny pour travailler en mode régulier.

source: (See 'Tools → Options → General' if you change your mind later.)
fr_fr: (Voir 'Outils → Options → Général' si vous changez d'avais plus tard.)

source: Problem showing
fr_fr: Un problème apparaît

source: View %s not created
fr_fr: La vue %s n'a pas été créée

source: Problem when handling '
fr_fr: Problème a la gestion de '

source: Couldn't find menu
fr_fr: Impossible de trouver le menu

source: Missing caption for '%s'. Toolbar commands must have caption.
fr_fr: La légende fait défaut pour '%s'. Les commandes de la barre d'outil doivent avoir une légende.

source: About Thonny
fr_fr: Au sujet de Thonny

source: Made in
fr_fr: Fait à

source: University of Tartu, Estonia,
fr_fr: l'Université de Tartu, Estonie,

source: with the help from
fr_fr: avec l'aide de

source: open-source community,
fr_fr: la communauté open-source,

source: Raspberry Pi Foundation
fr_fr: la Fondation Raspberry PI

source: and Cybernetica AS
fr_fr: et Cybernetica AS

source: This program comes with
fr_fr: Ce programme est distribué sans

source: ABSOLUTELY NO WARRANTY!
fr_fr: ABSOLUMENT AUCUNE GARANTIE !

source: It is free software, and you are welcome to
fr_fr: C'est un logiciel libre, et vous pouvez le

source: redistribute it under certain conditions, see
fr_fr: redistribuer sous certaines conditions, voir

source: for details
fr_fr: pour les détails

source: Version history
fr_fr: Historique des versions

source: Report problems
fr_fr: Signaler des problèmes

source: Open Assistant automatically when program crashes with an exception
fr_fr: Ouvrir l'Assistant automatiquement quand le programme plante avec une exception

source: Open Assistant automatically when it has warnings for your code
fr_fr: Ouvrir l'Assistant automatiquement quand il y a des avertissements issus du code

source: Perform selected Pylint checks
fr_fr: Réaliser les vérifications sélectionnées de Pylint

source: Perform MyPy checks
fr_fr: Réaliser les vérifications MyPy

source: Disabled checks (one id per line)
fr_fr: Vérifications désactivées (un id par ligne)

source: Node
fr_fr: Nœud

source: Code range
fr_fr: Zone de code

source: Autocomplete error
fr_fr: Erreur d'auto-complétion

source: Auto-complete
fr_fr: Auto-complétion

source: Which interpreter or device should Thonny use for running your code?
fr_fr: Quel interpréteur ou périphérique devrait utiliser Thonny pour lancer votre code ?

source: Details
fr_fr: Détails

source: Interpreter
fr_fr: Interpréteur

source: About Birdseye
fr_fr: Au sujet de l'Œil d'oiseau (Birdseye)

source: Birdseye is a Python debugger which needs to be installed separately.
fr_fr: œil d'oiseau (Birdseye) est un débogueur Python qu'on doit installer séprément.

source: Do you want to open the help page and learn more?
fr_fr: Voulez-vous ouvrir la page d'aide et en savoir plus ?

source: Debug current script (birdseye)
fr_fr: Débogage du script courant (Œil d'oiseau)

source: birdseye
fr_fr: Œil d'oiseau

source: Run cell
fr_fr: Exécuter la cellule

source: Run cell and advance
fr_fr: Exécuter la cellule et avancer

source: Run selection or current line
fr_fr: Exécuter la sélection ou la ligne courante

source: Toggle comment
fr_fr: Basculer le mode commentaire

source: Comment out
fr_fr: Passer en mode commentaire

source: Uncomment
fr_fr: Défaire le commentaire

source: Undo
fr_fr: Défaire

source: Redo
fr_fr: Refaire

source: Select all
fr_fr: Tout sélectionner

source: Could not find frame %d
fr_fr: Impossible de trouver le fil de programme %d

source: Run to cursor
fr_fr: Exécuter jusqu'au curseur

source: Frame doesn't exist anymore
fr_fr: La fenêtre n'existe plus

source: Function call at
fr_fr: Appel de fonction à

source: <<< REPLAYING >>>
fr_fr: <<< À NOUVEAU >>>

source: Can't close yet
fr_fr: Impossible de fermer en ce moment

source: Use "Stop" command if you want to cancel debugging
fr_fr: Utilisez la commande "Stop" si vous voullez sortir du débogage

source: Local variables
fr_fr: Variables locales

source: %s, line %s
fr_fr: %s, ligne %s

source: If last command raised an exception then this view will show the stacktrace.
fr_fr: Si la dernière commande a provoqué une exception, cela montrera la trace en pile.

source: Trying to send debugger command without debugger
fr_fr: Essai d'envoi d'une commande de débogage sans le débogueur

source: Open and close Stack view automatically
fr_fr: Ouvre et ferme la vue PIle automatiquement

source: Opens the Stack view on first call and
fr_fr: Pouvre la vue Pile au premier appel et

source: closes it when program returns to main frame.
fr_fr: la referme quand le programme revient au fil principal

source: Allow stepping into libraries (ie. outside of main script directory)
fr_fr: Autoriser le mode pas-à-pas dans les bibliothèques (i.e. hors du répertoire du script principal)

source: May make debugging slower.
fr_fr: Peut rendre le débogage plus lent.

source: (used when clicking Debug toolbar button)
fr_fr: (utilisé quand on clique sur le bouton de débogage de la barre d'outils)

source: Birdseye port
fr_fr: Port Œil d'oiseau

source: (restart Thonny after changing this)
fr_fr: (relancer Thonny après ce changement)

source: Resume
fr_fr: Reprendre

source: Debug current script
fr_fr: Déboguer le script courant

source: Debug
fr_fr: Débogage

source: Debug current script (nicer)
fr_fr: Débogage du script courant (joli)

source: Debug (nicer)
fr_fr: Déboguer (joli)

source: Debug current script (faster)
fr_fr: Débogage du script courant (vite)

source: Debug (faster)
fr_fr: Débogage (vite)

source: Step over
fr_fr: Sauter par-dessus

source: Over
fr_fr: Par-dessus

source: Step into
fr_fr: Sauter dedans

source: Into
fr_fr: Dedans

source: Step out
fr_fr: Ressortir

source: Out
fr_fr: Dehaors

source: Step back
fr_fr: Un pas en arrière

source: Back
fr_fr: Arrière

source: Stack
fr_fr: Pile

source: Debugger
fr_fr: Débogueur

source: Dock user windows
fr_fr: Fenêtres utilisateurs en icônes

source: Highlight matching names
fr_fr: Distinguer les noms qui collent

source: Highlight local variables
fr_fr: Distinguer les variables locales

source: Highlight parentheses
fr_fr: Distinguer les parenthèses

source: Highlight syntax elements
fr_fr: Distinguer les éléments syntaxiques

source: Highlight current line (requires reopening the editor)
fr_fr: Distinguer la ligne courante (nécessite de rouvrir l'éditeur)

source: Allow code completion with Tab-key in editors
fr_fr: Autoriser la complétion de code dans les éditeurs avec la touche Tab

source: Allow code completion with Tab-key in Shell
fr_fr: Autoriser la complétion de code dans le Shell avec la touche Tab

source: Show line numbers
fr_fr: Montrer les numéros de lignes

source: Recommended maximum line length (Set to 0 to turn off margin line)
fr_fr: Longueur maximale recommandée de ligne (Mettre à 0 pour supprimer la ligne de marge)

source: Editor
fr_fr: Éditeur

source: Export usage logs...
fr_fr: Exporter les journaux d'utilisation ...

source: Zip-files
fr_fr: Fichiers Zip

source: Events
fr_fr: Événements

source: Files
fr_fr: Fichiers

source: Find & Replace
fr_fr: Rechercher & Remplacer

source: Find:
fr_fr: Rechercher :

source: Replace with:
fr_fr: Remplacer par :

source: Case sensitive
fr_fr: Sensible à la casse

source: Up
fr_fr: En haut

source: Down
fr_fr: En bas

source: Find
fr_fr: Rechercher

source: Replace
fr_fr: Remplacer

source: Replace+Find
fr_fr: Remplacer+Rechercher

source: Replace all
fr_fr: Tout remplacer

source: Enter string to be replaced.
fr_fr: Entrez la chaîne à remplacer

source: The specified text was not found!
fr_fr: Le texte demandé n'a pas été trouvé !

source: Allow only single Thonny instance
fr_fr: N'autorise qu'une seule instance de Thonny

source: Debug mode (provides more detailed logs)
fr_fr: Mode débogage (produit des messages plus détaillés)

source: Reopen all files from previous session
fr_fr: Rouvrir tous les fichiers de la dernière session

source: Disable notification sound
fr_fr: Désactiver le son de notification

source: Language
fr_fr: Langue

source: UI mode
fr_fr: Mode de l'Interface

source: UI scaling factor
fr_fr: Facteur d'échelle de l'Interface

source: Font scaling mode
fr_fr: Facteur d'échelle de police

source: NB! Restart Thonny after changing these options
fr_fr: NB ! Relancer Thonny après ce changement d'options

source: in order to see the full effect
fr_fr: afin de voir l'effet

source: General
fr_fr: Général

source: Heap mode is on. Close Heap view to turn it off.
fr_fr: Le mode Tas est activé. Fermer la vue Tas pour le désactiver.

source: Heap
fr_fr: Tas

source: This box is meant for your working notes -- assignment instructions,
fr_fr: Cette boîte sert pour votre prise de notes -- les instructions d'affectation,

source: code snippets, whatever.
fr_fr: les bouts de code, tout ce que vous voulez.

source: Everything will be saved automatically
fr_fr: Tout sera enregistré automatiquement

source: and loaded when you open Thonny next time.
fr_fr: et chargé quand vous ovrirez Thonny la prochaine fois.

source: Feel free to delete this text to make room for your own notes.
fr_fr: Supprimez ce texte si vous voulez, pour faire place à vos notes.

source: Notes
fr_fr: Notes personnelles

source: Previous object
fr_fr: Objet précédent

source: Next object
fr_fr: Objet suivant

source: object @
fr_fr: objet @

source: Value ID
fr_fr: ID de valeur

source: Value
fr_fr: Valeur

source: Key ID
fr_fr: ID de clé

source: Key
fr_fr: Clé

source: Unsupported image data (%s)
fr_fr: Données d'image non supportées (%s)

source: Object inspector
fr_fr: Inspecteur d'objet

source: Outline
fr_fr: Aperçu

source: Pygame Zero mode
fr_fr: Mode Pygame Zéro

source: Find package from PyPI
fr_fr: Trouver un paquet dans PyPI

source: Upgrade
fr_fr: Mettre à jour

source: Uninstall
fr_fr: Désinstaller

source: Installing pip
fr_fr: Installer pip

source: pip, a required module for managing packages is missing or too old.
fr_fr: pip, un module requis pour gérer les paquets, est absent ou trop ancien.

source: Downloading pip installer (about 1.5 MB), please wait ...
fr_fr: Téléchargement de l'installer pip (environ 1,5 Mo), veuillez patienter ...

source: Installing pip, please wait ...
fr_fr: Installtion de pip, veuillez patientier ...

source: Error while installing pip:
fr_fr: Erreur à l'installation de pip :

source: You seem to have problems with pip
fr_fr: Vous semblez avoir des problèmes avec pip

source: pip, a required module for managing packages is missing or too old for Thonny.
fr_fr: pip, un module requis pour gérer les paquets, est absent ou trop ancien pour Thonny.

source: If your system package manager doesn't provide recent pip (9.0.0 or later),
fr_fr: Si votre système de dispose pas d'un pip récent (9.0.0 ou plus),

source: then you can install newest version by downloading
fr_fr: alors vous pouvez installer la dernière version en téléchargeant

source: and running it with
fr_fr: et en la lançant avec

source: (probably needs admin privileges).
fr_fr: (cela nécessite probablement des privilèges d'administration).

source: Alternatively, if you have an older pip installed, then you can install packages
fr_fr: Ou encore, si vous avez un pip plus ancien installé, alors vous pouvez installer des paquets

source: on the command line (Tools → Open system shell...)
fr_fr: sur la ligne de commande (Outils → Ouvrir un Shell système ...)

source: Browse the packages
fr_fr: Chercher dans les paquets

source: With current interpreter you can only browse the packages here.
fr_fr: Avec l'interpréteur courant vous ne pouvez chercher dans les paquets qu'ici.

source: Use 'Tools → Open system shell...' for installing, upgrading or uninstalling.
fr_fr: Utilisez 'Outils → Ouvrir un Shell système ...' pour installer, mettre à jour ou désinstaller.

source: Packages' directory
fr_fr: Répertoire des paquets

source: Install from PyPI
fr_fr: Installer depuis PyPI
