Repository: georgesk/thonny
Catalog: thonny/locale/*/LC_MESSAGES/thonny.po
Languages: fr_fr

source: If you don't know where to get the package from,
fr_fr: Si vous ne savez pas d'où récupérer un paquet,

source: then most likely you'll want to search the Python Package Index.
fr_fr: alors très probablement vous devrez rechercher dans l'Index des Paquets Python.

source: Start by entering the name of the package in the search box above and pressing ENTER.
fr_fr: Commencez par entrer le nom du paquet dans la boîte de recherche ci-dessus et appuyez sur ENTRÉE.

source: Install from local file
fr_fr: Installer depuis un fichier local

source: Click
fr_fr: Cliquez

source: here
fr_fr: ici

source: to locate and install the package file (usually with .whl, .tar.gz or .zip extension).
fr_fr: pour trouver et installer le fichier du paquet (d'ordinaire avec le suffixe .whl, .tar.gz ou .zip)

source: Upgrade or uninstall
fr_fr: Mettre à jour ou désinstaller

source: Start by selecting the package from the left.
fr_fr: Commencez à sélectionner le paquet depuis la gauche.

source: Target:
fr_fr: Cible :

source: virtual environment
fr_fr: environnement virtuel

source: user site packages
fr_fr: paquets utilisateurs pour le site

source: This dialog lists all available packages,
fr_fr: Ce dialogue liste tous les paquets disponibles,

source: but allows upgrading and uninstalling only packages from
fr_fr: mais il n'autorise la mise à jour et la désinstallation des paquets que depuis

source: . New packages will be also installed into this directory.
fr_fr: . Les nouveaux paquets seront aussi installés dans ce répertoire.

source: Other locations must be managed by alternative means.
fr_fr: Les autres emplacements doivent être gérés par des moyens alternatifs.

source: Installed version:
fr_fr: Versions installés :

source: Installed to:
fr_fr: Intallé sur :

source: Upgrade
fr_fr: Mise à jour

source: Install
fr_fr: Installation

source: Could not find the package from PyPI.
fr_fr: Impossible de trouver le paquet dans PyPI.

source: Please check your spelling!
fr_fr: Veuillez vérifier votre orthographe !

source: You need to enter
fr_fr: Vous devez entrer

source: exact package name
fr_fr: le nom du paquet exact

source: Could not find the package info from PyPI. Error code:
fr_fr: Impossible de trouver l'information du paquet depuis PyPI. Code d'erreur :

source: Latest stable version
fr_fr: Dernière version stable

source: Latest version
fr_fr: Dernière version

source: Summary
fr_fr: Résumé

source: Author
fr_fr: Auteur

source: Homepage
fr_fr: Page d'accueil

source: Bugtracker
fr_fr: Suivi des bogues

source: PyPI page
fr_fr: Page PyPI

source: Requires
fr_fr: Dépendances

source: Can't find package name from the list:
fr_fr: Impossible de trouver le nom du paquet depuis la liste :

source: Really uninstall?
fr_fr: Vraiment désinstaller ?

source: Package '{}' is required for installing and uninstalling other packages.
fr_fr: Le paquet '{}' est requis pour installer ou désinstaller d'autres paquets.

source: Are you sure you want to uninstall it?
fr_fr: Êtes-vous sûr de vouloir le désinstaller ?

source: Unknown action
fr_fr: Action inconnue

source: Package
fr_fr: Paquet

source: Manage packages for
fr_fr: Gestion des paquets pour

source: Looks like you are installing a Thonny-related package.
fr_fr: Il semble que vous êtes en train d'installer un paquet lié à Thonny.

source: If you meant to install a Thonny plugin, then you should
fr_fr: Si vous voulez installer un greffon Thonny, alors vous devriez

source: choose 'Tools → Manage plugins...' instead
fr_fr: plutôt choisir 'Outils → Gestion des greffons ...'

source: Are you sure you want to install '
fr_fr: Êtes-vous sûr de vouloir installer '

source: ' for the back-end?
fr_fr: ' pour la tâche d'arrière plan ?

source: NB! There may be another version available
fr_fr: NB ! Il peut y avoir une autre version disponible

source: which is compatible with current Thonny version.
fr_fr: qui est compatible avec la version courante de Thonny.

source: Click on '...' button to choose the version to install.
fr_fr: Cliquez sur le bouton '...' pour choisir quelle version installer.

source: Thonny plugin without requirements
fr_fr: Greffon Thonny sans dépendances

source: Looks like you are trying to install an outdated Thonny
fr_fr: On dirait que vous essayez d'installer un greffon

source: plug-in (it doesn't specify required Thonny version).
fr_fr: Thonny obsolète (il ne spécifie pas de version de Thonny).

source: If you still want it, then please install it from the command line.
fr_fr: Si vous y tenez, veuillez l'installer depuis la ligne de commande.

source: Unsuitable requirements
fr_fr: Dépendances incompatibles

source: This package requires different Thonny version:
fr_fr: Ce paquet requiert une version de thonny différente :

source: If you still want it, then please install it from the command line.
fr_fr: Si vous y tenez, veuillez l'installer depuis la ligne de commande.

source: This dialog is for managing Thonny plug-ins and their dependencies.
fr_fr: Ce dialogue sert à gérer les greffons de Thonny et leurs dépendances.

source: If you want to install packages for your own programs then choose 'Tools → Manage packages...'
fr_fr: Si vous voulez installer des paquets pour vos propres programmes alors choisissez 'Outils → Gestion des paquets ...'

source: (In this case Thonny's back-end uses same interpreter, so both dialogs manage same packages.)
fr_fr: (Dans ce cas la tâche de fond de Thonny utilise le même interpréteur, donc les deux dialogues gèrent les mêmes paquets.)

source: NB! You need to restart Thonny after installing / upgrading / uninstalling a plug-in.
fr_fr: NB ! Vous devez redémarrer Thonny après installation / mise à jour / désinstallation de greffons.

source: Thonny plug-ins
fr_fr: Greffons Thonny

source: Advanced install / upgrade / downgrade
fr_fr: Installation avancée / mise à jour / régression

source: Desired version
fr_fr: Version désirée

source: Upgrade dependencies
fr_fr: Mise à jour des dépendances

source: Requires: *
fr_fr: Dépendances : *

source: Error code:
fr_fr: Code d'erreur :

source: Error:
fr_fr: Erreur :

source: Manage packages...
fr_fr: Gérer les paquets ...

source: Manage plug-ins...
fr_fr: Gérer les greffons ...

source: Maximum number of lines to keep. NB! Large values may cause poor performance!
fr_fr: Nombre maximum de lignes à conserver. N.B. ! une grande valeur peu diminuer la performance !

source: Configure shell macro
fr_fr: Configurer la macro Shell

source: These are instructions asdfa afs fa sfasdf
fr_fr: Voici les instructions asdfa afs fa sfasdf

source: Save and execute
fr_fr: Enregistrer et exécuter

source: Configure shell macro...
fr_fr: Configurer la macro Shell ...

source: Execute shell macro
fr_fr: Exécuter la macro Shell

source: Running current script in terminal:
fr_fr: Lancer le script courant dans le terminal :

source: Present Python REPL after program ends
fr_fr: Présenter l'invite Python après la fin du programme

source: Keep terminal window open after Python process ends
fr_fr: Garder la fenêtre du terminal ouverte après la fin du processus Python

source: NB! Automatic closing needs to be enabled in Terminal's settings
fr_fr: NB ! il faut activer la fermeture automatique dans les réglages du Terminal

source: (Profiles → Shell → When the shell exits)
fr_fr: (Profils → Shell → Quand le Shell existe)

source: UI theme
fr_fr: Thème de l'interface

source: Syntax theme
fr_fr: Thème de la syntaxe

source: Editor font
fr_fr: Police de l'éditeur

source: Size
fr_fr: Taille

source: Editor preview
fr_fr: Prévisualiser l'éditeur

source: NB! Some style elements change only after restarting Thonny
fr_fr: NB ! Certains éléments de style ne changent qu'après le redémarrage de Thonny

source: Theme & Font
fr_fr: Thème & Polices

source: Open Thonny program folder...
fr_fr: Ouvrir le répertoire des programmes de Thonny ...

source: Open Thonny data folder...
fr_fr: Ouvrir le répertoire des données de Thonny ...

source: Back to current frame
fr_fr: Retour à l'écran courant

source: Back to
fr_fr: Retour à

source: Help contents
fr_fr: Contenus de l'aide

source: Could not connect to REPL.
fr_fr: Connexion impossible au REPL (Read Evaluate Print Loop)

source: Make sure your device has suitable firmware and is not in bootloader mode!
fr_fr: Assurez-vous que votre périphérique a le micrologiciel convenable et n'est pas en mode de chargement du démarreur (bootloader) !

source: Bytes read:
fr_fr: Octets lus :

source: Disconnecting.
fr_fr: Déconnexion.

source: Warning: when issuing %r, incoming was not emtpy: %r
fr_fr: Avertissement : quand on a envoyé %r, la queue d'entrée n'était pas vide : %r

source: Connection closed. Select Run → Stop/Restart or press Ctrl+F2 to connect again.
fr_fr: Connexion fermée. Sélectionner Exécuter → Arrêter/Redémarrer ou taper Ctrl+F2 pour la reconnexions.

source: Problem when closing serial connection:
fr_fr: Problème à la fermeture de la connexion série :

source: Not connected. Choose "Tools → Options → Backend" to change.
fr_fr: Non connecté. Choisir "Outils → Options → Tâche d'arrière-plan" pour changer.

source: Couldn't find the device automatically. Check the connection (making sure the device is not in bootloader mode) or choose "Tools → Options → Backend" to select the port manually.
fr_fr: Impossible de trouver le périphérique automatiquement. Vérifiez la connexion (en vous assurant que le périphérique n'est pas en mode chargement du démarreur -- bootloader) ou choisissez "Outils → Options → Tâche d'arrière-plan" pour sélectionner le port manuellement.

source: Likely candidates are: *
fr_fr: Les candidates probables sont : *

source: Unable to connect to
fr_fr: Impossible de se connecter à

source: Error:
fr_fr: Erreur :

source: Try adding yourself to the 'dialout' group: > sudo usermod -a -G dialout <username> (NB! This needs to be followed by reboot or logging out and logging in again!)
fr_fr: Essayez de vous ajouter au groupe 'dialout' : > sudo usermod -a -G dialout <nom_d_utilisateur> (NB ! Il faut ensuite redémarrer l'ordinateur ou vous déconnecter/reconnecter !)

source: If you have serial connection to the device from another program, then disconnect it there.
fr_fr: Si vous avez établi une connexion série au périphérique par un autre programme, alors fermez cette connexion.

source: Try restarting the device.
fr_fr: Essayez de redémarrer le périphérique.

source: Could not connect to
fr_fr: Connexion impossible à

source: Check the configuration, select Run → Stop/Restart or press Ctrl+F2 to try again.
fr_fr: Vérifiez la configuration, sélectionner Exécuter → Arrêter/Redémarrer ou taper Ctrl+F2 pour réessayer.

source: (On some occasions it helps to wait before trying again.)
fr_fr: (Dans certaines occasions c'est utile d'attendre avant de recommencer.)

source: Error was: %r
fr_fr: L'erreur était : %r

source: Can't get to raw prompt
fr_fr: Impossible d'accèder à l'invite brute

source: Lost connection to the device (%s).
fr_fr: La connexions au périphérique (%s) est perdue.

source: Expected OK, got %s, followed by %s
fr_fr: On attendait OK, on a reçut %s, suivi par %s

source: Error was
fr_fr: L'erreur était

source: Output was
fr_fr: La sortie était

source: Path doesn't exist: %s
fr_fr: Le chemin n'existe pas : %s

source: Error requesting globals:\n
fr_fr: Erreur en demandant les variabes globales :\n

source: Error requesting file data:\n
fr_fr: Erreur en demandant les donnees du fichier :\n

source: FAILED IMPORTING MODULE:
fr_fr: ECHEC A L'IMPORTATION DU MODULE :

source: SKIPPING problematic name:
fr_fr: Nom problematique OMIS :

source: DUMPING
fr_fr: VIDAGE MEMOIRE

source: ERRORS
fr_fr: ERREURS

source: Command requires one argument
fr_fr: La commande necessite un argument

source: Command requires 1 or 2 arguments
fr_fr: La commande necessite 1 ou 2 arguments

source: No such file: %s
fr_fr: Pas de fichier : %s

source: %s has syntax errors: %s File will not be uploaded.
fr_fr: %s a des erreurs de syntaxe : %s Le fichier ne sera pas téléversé.

source: Couldn't write to %s Original error: %s If the target directory exists then it may be corrupted.
fr_fr: In possible d'écrire dans %s Erreur originale : %s Si le répertoire cible existe il pourrait être corrompu.

source: Could not find volume
fr_fr: Impossible de trouver le volume

source: Found several possible mount points: %s
fr_fr: Plusieurs points de montage possibles ont été trouvés : %s

source: Got %s
fr_fr: Reçus %s

source: File not found: %s
fr_fr: Fichier non trouvé : %s

source: Couldn't connect to the raw REPL. Serial output:
fr_fr: Connexion manquée au REPL brut. Sortie série :

source: Uploading firmware
fr_fr: Téléversement du micrologiciel

source: Done. NB! If opening REPL fails on first trial then wait a second and try again.
fr_fr: Terminé. NB ! Si l'ouverture du REPL echoue au premier essai attendez une seconde et recommencez.

source: Connect your device to the computer and select corresponding port below (look for your device name,
fr_fr: Connectez votre périphérique à l'ordinateur et sélectionnez le port correspondant ci-dessous (rechercher le nom de votre périphérique,

source: "USB Serial" or "UART"). If you can't find it, you may need to install proper USB driver first.
fr_fr: "USB Serial" ou "UART"). Si vous ne pouvez pas le trouver, vous aurez peut-être à installer d'abord un pilote USB adéquat.

source: Connecting via USB cable:
fr_fr: Connexion via le câble USB :

source: Connecting via WebREPL protocol:
fr_fr: Connexion via le protocole WebREPL :

source: If your device supports WebREPL, first connect via serial, make sure WebREPL is enabled
fr_fr: Si votre périphérique supporte WebREPL, connectez-le d'abord par voie série, assurez-vous que WebREPL est activé

source: (import webrepl_setup), connect your computer and device to same network and select < WebREPL > below
fr_fr: (importez webrepl_setup), connectez votre ordinateur et votre périphérique au même réseau et sélectionnez < WebREPL > ci-dessous

source: Port or WebREPL
fr_fr: Port ou WebREPL

source: URL (eg. %s)
fr_fr: URL (p. ex. %s)

source: Password (the one specified with `import webrepl_setup`)
fr_fr: Mot de passe (celui qui a été spécifié avec `import webrepl_setup`)

source: Reaction timeout. Bytes read: %s
fr_fr: Dépassement du temps de réaction. Octets reçus : %s

source: Serial reading error: %s
fr_fr: Erreur de lecture série : %s

source: prelude
fr_fr: Prélude

source: GOT
fr_fr: REÇU

source: sending password
fr_fr: envoi du mot de passe

source: sent password
fr_fr: mot de passe envoyé

source: Read:
fr_fr: Lecture :

source: Wrote:
fr_fr: Écriture :

source: MicroPython on a generic device
fr_fr: MicroPython su un périphérique générique

source: Select device
fr_fr: Sélectionner le périphérique

source: Soft reboot
fr_fr: Redémarrage logiciel

source: Upload current script as main script
fr_fr: Téléverser le script courant comme script principal

source: Upload current script as boot script
fr_fr: Téléverser le script courant comme script de démarrage

source: Upload current script with current name
fr_fr: Téléverser le script courant avec le nom courant

source: Show device's main script
fr_fr: Montrer le script principal du périphérique

source: Show device's boot script
fr_fr: Montrer le script de démarrage du périphérique

source: Close serial connection
fr_fr: Fermer la connexion série

source: Print...
fr_fr: Imprimer ...

source: Open system shell...
fr_fr: Ouvrir un Shell système ...
